In [3]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
df=pd.DataFrame(np.random.randn(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4"])

In [6]:
df.head()

       Column1   Column2   Column3   Column4
Row1  0.987217  0.468322  1.575476 -0.301628
Row2  0.928961 -0.441506  0.028289 -2.572146
Row3 -0.416037 -0.041849  0.190811 -0.450985
Row4  1.761546 -1.085562 -0.655503  0.657133
Row5 -0.253968  1.215606 -0.091492  0.357957

In [7]:
df.head(2)

       Column1   Column2   Column3   Column4
Row1  0.987217  0.468322  1.575476 -0.301628
Row2  0.928961 -0.441506  0.028289 -2.572146

In [8]:
df.tail()

       Column1   Column2   Column3   Column4
Row1  0.987217  0.468322  1.575476 -0.301628
Row2  0.928961 -0.441506  0.028289 -2.572146
Row3 -0.416037 -0.041849  0.190811 -0.450985
Row4  1.761546 -1.085562 -0.655503  0.657133
Row5 -0.253968  1.215606 -0.091492  0.357957

In [9]:
df['Column1']

Row1    0.987217
Row2    0.928961
Row3   -0.416037
Row4    1.761546
Row5   -0.253968
Name: Column1, dtype: float64

In [10]:
df[['Column1','Column3']]

       Column1   Column3
Row1  0.987217  1.575476
Row2  0.928961  0.028289
Row3 -0.416037  0.190811
Row4  1.761546 -0.655503
Row5 -0.253968 -0.091492

In [11]:
df.loc['Row1']

Column1    0.987217
Column2    0.468322
Column3    1.575476
Column4   -0.301628
Name: Row1, dtype: float64

In [12]:
type(df.loc['Row1'])

pandas.core.series.Series

In [13]:
df.iloc[0:2,1:3]

       Column2   Column3
Row1  0.468322  1.575476
Row2 -0.441506  0.028289

In [14]:
df.iloc[3:,2:]

       Column3   Column4
Row4 -0.655503  0.657133
Row5 -0.091492  0.357957

In [15]:
df.iloc[:,1:].values

array([[ 0.46832234,  1.57547628, -0.30162759],
       [-0.44150589,  0.02828857, -2.57214591],
       [-0.04184923,  0.19081096, -0.4509854 ],
       [-1.08556159, -0.65550263,  0.65713264],
       [ 1.21560601, -0.09149191,  0.35795707]])

In [16]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [17]:
df.isnull()

      Column1  Column2  Column3  Column4
Row1    False    False    False    False
Row2    False    False    False    False
Row3    False    False    False    False
Row4    False    False    False    False
Row5    False    False    False    False

In [18]:
df['Column1'].value_counts()

-0.416037    1
 1.761546    1
 0.928961    1
 0.987217    1
-0.253968    1
Name: Column1, dtype: int64

In [19]:
df['Column1'].unique()

array([ 0.98721739,  0.92896072, -0.41603747,  1.76154558, -0.25396797])

In [20]:
df.shape

(5, 4)

In [21]:
df.describe()

        Column1   Column2   Column3   Column4
count  5.000000  5.000000  5.000000  5.000000
mean   0.601544  0.023002  0.209516 -0.461934
std    0.917731  0.876000  0.827331  1.265241
min   -0.416037 -1.085562 -0.655503 -2.572146
25%   -0.253968 -0.441506 -0.091492 -0.450985
50%    0.928961 -0.041849  0.028289 -0.301628
75%    0.987217  0.468322  0.190811  0.357957
max    1.761546  1.215606  1.575476  0.657133

In [22]:
df.corr()

          Column1   Column2   Column3   Column4
Column1  1.000000 -0.690534 -0.085410 -0.009375
Column2 -0.690534  1.000000  0.446238  0.177772
Column3 -0.085410  0.446238  1.000000 -0.146548
Column4 -0.009375  0.177772 -0.146548  1.000000

In [23]:
df[df['Column1']>0.2]

       Column1   Column2   Column3   Column4
Row1  0.987217  0.468322  1.575476 -0.301628
Row2  0.928961 -0.441506  0.028289 -2.572146
Row4  1.761546 -1.085562 -0.655503  0.657133

In [24]:
df

       Column1   Column2   Column3   Column4
Row1  0.987217  0.468322  1.575476 -0.301628
Row2  0.928961 -0.441506  0.028289 -2.572146
Row3 -0.416037 -0.041849  0.190811 -0.450985
Row4  1.761546 -1.085562 -0.655503  0.657133
Row5 -0.253968  1.215606 -0.091492  0.357957